{
  "architectures": [
    "ElectraForPreTraining"
  ],
  "attention_probs_dropout_prob": 0.0,
  "embedding_size": 1280,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 1280,
  "initializer_range": 0.02,
  "intermediate_size": 5120,
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 40000,
  "model_type": "electra",
  "num_attention_heads": 20,
  "num_hidden_layers": 32,
  "pad_token_id": 0,
  "type_vocab_size": 2,
  "vocab_size": 30
}
